# Module 4 Project 4: Jupyter Notebooks
# Desiree Blake: https://github.com/dblake3377

## Task 2 - DataFrames

Creating DataFrame from a Dictionary

In [38]:
# Creating DataFrame from a Dictionary
import pandas as pd 
grades_dict = {'Wally': [87, 96, 70], 'Eva': [100, 87, 90], 'Sam': [94, 77, 90],'Katie':[100, 81, 82], 'Bob': [83, 65, 85]}
grades = pd.DataFrame(grades_dict)
grades

   Wally  Eva  Sam  Katie  Bob
0     87  100   94    100   83
1     96   87   77     81   65
2     70   90   90     82   85

Customizing DataFrame's Indices with the index Attribute

In [39]:
#Customizing DataFrame's Indices w/ index Attribute
grades.index= ['Test 1', 'Test 2', 'Test 3']
grades

        Wally  Eva  Sam  Katie  Bob
Test 1     87  100   94    100   83
Test 2     96   87   77     81   65
Test 3     70   90   90     82   85

Selecting Subsets of Rows and Columns

In [40]:
#Subsets of Rows and Columns 
#Eva's grades by name
grades['Eva']

Test 1    100
Test 2     87
Test 3     90
Name: Eva, dtype: int64

In [41]:
#Subsets of Rows and Columns 
#Sam Attribute
grades.Sam

Test 1    94
Test 2    77
Test 3    90
Name: Sam, dtype: int64

Boolean Indexing

In [42]:
#Grades greater than or equal to 90
grades[grades >= 90]

        Wally    Eva   Sam  Katie  Bob
Test 1    NaN  100.0  94.0  100.0  NaN
Test 2   96.0    NaN   NaN    NaN  NaN
Test 3    NaN   90.0  90.0    NaN  NaN

In [43]:
#B Grades
grades[(grades >= 80) & grades < 90]

        Wally  Eva  Sam  Katie  Bob
Test 1     87  100   94    100   83
Test 2     96   87   77     81   65
Test 3     70   90   90     82   85

Descriptive Statistics

In [44]:
#Describe
grades.describe()

           Wally         Eva        Sam       Katie        Bob
count   3.000000    3.000000   3.000000    3.000000   3.000000
mean   84.333333   92.333333  87.000000   87.666667  77.666667
std    13.203535    6.806859   8.888194   10.692677  11.015141
min    70.000000   87.000000  77.000000   81.000000  65.000000
25%    78.500000   88.500000  83.500000   81.500000  74.000000
50%    87.000000   90.000000  90.000000   82.000000  83.000000
75%    91.500000   95.000000  92.000000   91.000000  84.000000
max    96.000000  100.000000  94.000000  100.000000  85.000000

Transposing the DataFrame

In [45]:
#Describe
grades.T.describe

<bound method NDFrame.describe of        Test 1  Test 2  Test 3
Wally      87      96      70
Eva       100      87      90
Sam        94      77      90
Katie     100      81      82
Bob        83      65      85>

Sorting by Rows and Columns

In [46]:
#Rows
grades.sort_index(ascending=False)

        Wally  Eva  Sam  Katie  Bob
Test 3     70   90   90     82   85
Test 2     96   87   77     81   65
Test 1     87  100   94    100   83

In [47]:
#Columns
grades.sort_index(axis=1)

        Bob  Eva  Katie  Sam  Wally
Test 1   83  100    100   94     87
Test 2   65   87     81   77     96
Test 3   85   90     82   90     70